; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 29)
	(= (value c1) 34)
	(= (value c2) 41)
	(= (value c3) 41)
	(= (value c4) 99)
	(= (value c5) 43)
	(= (value c6) 73)
	(= (value c7) 44)
	(= (value c8) 17)
	(= (value c9) 68)
	(= (value c10) 7)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 10
2. (increment c3)
   changed: (value c3) from 41 to 42
   goals met: 6 of 10
3. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 6 of 10
4. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 6 of 10
5. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 6 of 10
6. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 6 of 10
7. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 6 of 10
8. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 6 of 10
9. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 6 of 10
10. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 6 of 10
11. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 6 of 10
12. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 6 of 10
13. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 6 of 10
14. (increment c10)
   changed: (value c10) from 7 to 14
   goals met: 6 of 10
15. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 10
16. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 10
17. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 10
18. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 6 of 10
19. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 6 of 10
20. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 6 of 10
21. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 6 of 10
22. (increment c5)
   changed: (value c5) from 43 to 50
   goals met: 6 of 10
23. (increment c5)
   changed: (value c5) from 50 to 57
   goals met: 6 of 10
24. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 6 of 10
25. (increment c10)
   changed: (value c10) from 14 to 22
   goals met: 6 of 10
26. (increment c10)
   changed: (value c10) from 22 to 30
   goals met: 6 of 10
27. (increment c10)
   changed: (value c10) from 30 to 38
   goals met: 6 of 10
28. (increment c10)
   changed: (value c10) from 38 to 46
   goals met: 6 of 10
29. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 6 of 10
30. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 6 of 10
31. (increment c10)
   changed: (value c10) from 46 to 56
   goals met: 6 of 10
32. (increment c10)
   changed: (value c10) from 56 to 66
   goals met: 6 of 10
33. (increment c10)
   changed: (value c10) from 66 to 76
   goals met: 7 of 10
34. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 10
35. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 10
36. (increment c5)
   changed: (value c5) from 57 to 66
   goals met: 7 of 10
37. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 10
38. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 10
39. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 10
40. (increment c5)
   changed: (value c5) from 66 to 76
   goals met: 6 of 10
41. (increment c5)
   changed: (value c5) from 76 to 86
   goals met: 6 of 10
42. (decrement c4)
   changed: (value c4) from 99 to 97
   goals met: 6 of 10
43. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 6 of 10
44. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 6 of 10
45. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 6 of 10
46. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 6 of 10
47. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 10
48. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 6 of 10
49. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 6 of 10
50. (increment c8)
   changed: (value c8) from 17 to 24
   goals met: 6 of 10
51. (increment c8)
   changed: (value c8) from 24 to 31
   goals met: 6 of 10
52. (increment c8)
   changed: (value c8) from 31 to 38
   goals met: 6 of 10
53. (increment c8)
   changed: (value c8) from 38 to 45
   goals met: 7 of 10
54. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 10
55. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 10
56. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 10
57. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 10
58. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 10
59. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 10
60. (increment c7)
   changed: (value c7) from 44 to 50
   goals met: 6 of 10
61. (increment c8)
   changed: (value c8) from 45 to 52
   goals met: 7 of 10
62. (increment c7)
   changed: (value c7) from 50 to 56
   goals met: 6 of 10
63. (increment c7)
   changed: (value c7) from 56 to 62
   goals met: 6 of 10
64. (increment c8)
   changed: (value c8) from 52 to 59
   goals met: 6 of 10
65. (increment c8)
   changed: (value c8) from 59 to 66
   goals met: 7 of 10
66. (increment c7)
   changed: (value c7) from 62 to 68
   goals met: 6 of 10
67. (increment c7)
   changed: (value c7) from 68 to 74
   goals met: 7 of 10
68. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 10
69. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 10
70. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 10
71. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 7 of 10
72. (decrement c4)
   changed: (value c4) from 97 to 95
   goals met: 7 of 10
73. (decrement c4)
   changed: (value c4) from 95 to 93
   goals met: 7 of 10
74. (decrement c4)
   changed: (value c4) from 93 to 91
   goals met: 7 of 10
75. (decrement c4)
   changed: (value c4) from 91 to 89
   goals met: 7 of 10
76. (decrement c4)
   changed: (value c4) from 89 to 87
   goals met: 7 of 10
77. (decrement c4)
   changed: (value c4) from 87 to 85
   goals met: 8 of 10
78. (increment c8)
   changed: (value c8) from 66 to 73
   goals met: 7 of 10
79. (increment c9)
   changed: (value c9) from 68 to 72
   goals met: 7 of 10
80. (increment c9)
   changed: (value c9) from 72 to 76
   goals met: 7 of 10
81. (increment c10)
   changed: (value c10) from 76 to 86
   goals met: 8 of 10
82. (increment c8)
   changed: (value c8) from 73 to 80
   goals met: 8 of 10
83. (increment c9)
   changed: (value c9) from 76 to 80
   goals met: 8 of 10
84. (increment c9)
   changed: (value c9) from 80 to 84
   goals met: 9 of 10
85. (decrement c5)
   changed: (value c5) from 86 to 76
   goals met: 8 of 10
86. (decrement c5)
   changed: (value c5) from 76 to 66
   goals met: 9 of 10
87. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 9 of 10
88. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 9 of 10
89. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 9 of 10
90. (decrement c4)
   changed: (value c4) from 85 to 80
   goals met: 9 of 10
91. (decrement c4)
   changed: (value c4) from 80 to 75
   goals met: 9 of 10
92. (decrement c4)
   changed: (value c4) from 75 to 70
   goals met: 9 of 10
93. (decrement c4)
   changed: (value c4) from 70 to 65
   goals met: 10 of 10
